#+begin_src emacs-lisp :tangle org-cthulhu.el
(require 'cl-lib)
(require 'dash)
(require 'org-ml)
#+end_src

#+RESULTS:
: org-ml

* Ajout de sous-sections

#+begin_src emacs-lisp
(defvar default-sections
  '("Objets"
   "Personnages"
   "Monstres"
   "Lieux"
   "Événements"
   "Documentation"))

(defun get-document-sections ()
  (--map (org-ml-get-property :raw-value it) (org-ml-parse-subtrees 'all)))

(defun add-new-subsection (section subtitle content)
  (save-excursion
    (goto-char 0)
    (re-search-forward (s-lex-format "^* ${section}"))
    (org-insert-subheading (point))
    (insert subtitle)
    (org-newline-and-indent)
    (insert content)
    (org-id-get-create)))
#+end_src

#+RESULTS:
: add-new-subsection


#+begin_src emacs-lisp
(defun cthulhu-new-thing-and-make-link (type)
  (interactive "P")
  (let* ((type (if (not type) (completing-read "Sélection ?" (get-document-sections))
		 type))
	 (thing (read-from-minibuffer (s-lex-format "${type} à ajouter ?")))
	 (desc (read-from-minibuffer "Description"))
	 (id (add-new-subsection type thing desc)))
    (org-insert-link nil (concat "id:" id) thing)))

(defun make-adders (default-sections)
  (--map (let* ((type it)
                (fun-name (concat "cthulhu-new-" type "-and-make-link")))
           (defalias (intern fun-name) `(lambda () (interactive) (cthulhu-new-thing-and-make-link ,type))))
         default-sections))

(make-adders default-sections)
#+end_src

#+RESULTS:
| cthulhu-new-Objets-and-make-link | cthulhu-new-Personnages-and-make-link | cthulhu-new-Monstres-and-make-link | cthulhu-new-Lieux-and-make-link | cthulhu-new-Événements-and-make-link | cthulhu-new-Documentation-and-make-link |

** Tests de caractéristique


#+begin_src emacs-lisp :tangle org-cthulhu.el
(defun roll100 (&optional modif)
  "Lance un dé 100 avec des dés bonus/malus "
  (if (not modif)
      (random 100)
  (let* ((choose-dice-fun (if (< 0 modif) #'min #'max))
         (dizaines-chiffre (apply choose-dice-fun
                                  (loop for i below (1+ (abs modif))
                                        collect (random 10))))
         (unités-chiffre (random 10)))
    (+ unités-chiffre (* dizaines-chiffre 10))))))
    ;; (format "%d%d" dizaines-chiffre unités-chiffre)))

(defun roll (Ds F &optional modif)
  "Renvoie une liste de lancés de dés. "
  (if (= F 100)
      (loop for i below Ds
	    collect (roll100 modif))
    (loop for i below Ds
	  collect (1+ (random F)))))
#+end_src

#+RESULTS:
: roll100

#+begin_src emacs-lisp
(defun select-roll-character-carac (&optional modif)
  (interactive)
  (let* ((perso (select-character))
         (carac (select-get-carac perso))
         (roll (roll100 modif))
         (out (roll-success roll carac)))
    (message (format "%d [%d, %d, %d] : %s" roll carac (majeur carac) (extreme carac) (get-success out)))))

(select-roll-character-carac)
#+end_src

#+RESULTS:
: 32 [35, 17, 7] : Réussite normale

** Tests opposés

#+begin_src emacs-lisp

(defun cthulhu-test-opposé (&optional success1)
  (interactive "P")
  (let* ((perso1 (select-character))
         (out1 (if success1
                   (ask-success-type)
                 (roll-success (roll100) (select-get-carac perso1))))
         (perso2 (select-character))
         (comp2 (select-get-carac perso2))
         (out2 (roll-success (roll100) comp2)))
    (message 
    (cond
     ((< out1 out2) (format "Succès de %s (%s vs %s)"
                                     (get-name perso1) (get-success out1) (get-success out2)))
     ((< out2 out1) (format "Succès de %s (%s vs %s)"
                                     (get-name perso2) (get-success out2) (get-success out1)))
     (t "Pas de succès"))))))
#+end_src

#+RESULTS:
: cthulhu-test-opposé


#+begin_src emacs-lisp
(cthulhu-test-opposé)
#+end_src

#+RESULTS:
: Succès de Bobby Watson : un fameux concierge (Réussite majeure vs Échec)

** Nouveau tableau de combat

#+begin_src emacs-lisp
(defun build-column (rows personnage-name)
  (cons personnage-name
        (loop for row-name in rows
              collect (let ((carac (get-carac (select-character personnage-name) row-name)))
                        (if (not carac)
                            ""
                          (number-to-string (carac-value carac)))))))

(defun cthulhu-fight-new-fight (fighters-list)
  "Créer un tableau afin de suivre le combat entre les participants
présents dans fighters-list."
  (let* ((fighters-listo (--sort (> (get-carac-value it "DEX") (get-carac-value other "DEX")) fighters-list))
         (fighters-name (--map (get-name it) fighters-listo)))
    (cons (cons "Personnages" combat-mode-rows)
          (loop for fname in fighters-name
                collect (build-column combat-mode-rows fname)))))

(defun cthulhu-fight-new-fight-select-insert (num)
  "Sélectionne num participants et créé le tableau correspondant "
  (save-excursion 
    (insert (org-ml-to-trimmed-string (apply #'org-ml-build-table!
                                             (cthulhu-fight-new-fight (loop for i from 1 to num
                                                                            collect (select-character nil (format " %s/%s " i num))))))))
  (org-table-transpose-table-at-point)
  (org-table-insert-hline)
  (org-table-insert-hline t))

#+end_src

#+RESULTS:
: cthulhu-fight-new-fight-select-insert

#+begin_src emacs-lisp
(append '((1 2)) '((3 4) (5 6))))
#+end_src

#+RESULTS:
| 1 | 2 |
| 3 | 4 |
| 5 | 6 |



**** Caractéristiques 

#+TBLNAME: carac
| FOR | 90 | 25 | 10 |
| CON | 60 | 30 | 12 |
| TAI | 70 | 25 | 10 |
| DEX | 70 | 35 | 14 |
| INT | 50 | 25 | 10 |
| APP | 50 | 25 | 10 |
| POU | 55 | 27 | 11 |
| EDU | 10 |  5 |  2 |
| AGE | 35 |    |    |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

**** Santé physique et psychique

| Santé mentale   | 80 | 40 | 16 |
| Points de vie   | 13 |    |    |
| Points de magie | 16 |    |    |
| Chance          |    |  0 |  0 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

**** Caractéristiques de combat

| Corps à corps (1D3)          |  25 | 13 | 5 |
| -- Carrure                   |   1 |    |   |
| -- Impact                    | 1D4 |    |   |
| Armes à feu (armes de poing) |  20 | 10 | 4 |
| Armes à feu (fusils)         |  25 | 13 | 5 |
| Armes à feu (mitraillettes)  |  15 |  8 | 3 |
| -- Esquive                   |  35 | 17 | 7 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Sociales

| Baratin      |  5 | 3 | 1 |
| Charme       | 15 | 8 | 3 |
| Intimidation | 15 | 8 | 3 |
| Persuasion   | 10 | 5 | 2 |
| Psychologie  | 10 | 5 | 2 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Se repérer

| Bibliothèque        | 20 | 10 | 4 |
| Orientation         | 10 |  5 | 2 |
| Pister              | 10 |  5 | 2 |
| Trouver objet caché | 25 | 13 | 5 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Soins

| Premier soins | 30 | 15 | 6 |
| Médecine      |  1 |  1 | 0 |
| Psychanalyse  |  1 |  1 | 0 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Se déplacer

| Conduite   | 20 | 10 | 4 |
| Grimper    | 20 | 10 | 4 |
| Lancer     | 20 | 10 | 4 |
| Nager      | 20 | 10 | 4 |
| Pilotage   |  1 |  1 | 0 |
| Sauter     | 20 | 10 | 4 |
| Survie     | 10 |  5 | 2 |
| Écouter    | 20 | 10 | 4 |
| Équitation |  5 |  3 | 1 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Filouterie

| Discrétion | 20 | 10 | 4 |
| Imposture  |  5 |  3 | 1 |
| Crochetage |  1 |  1 | 0 |
| Pickpocket | 10 |  5 | 2 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Connaissances théoriques

| Anthropologie     |   1 |              1 |              0 |
| Archéologie       |   1 |              1 |              0 |
| Arts et métiers   |     |              0 |              0 |
| Droit | 555 | 277 | 111 |
| Histoire          |   5 |              3 |              1 |
| Langue maternelle | EDU | round(EDU / 2) | round(EDU / 5) |
| Langues (autre)   |   1 |              1 |              0 |
| Naturalisme       |  10 |              5 |              2 |
| Sciences          |   1 |              1 |              0 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

***** Argent 

| Comptabilité | 5 | 3 | 1 |
| Crédit       | 0 | 0 | 0 |
| Estimation   | 5 | 3 | 1 |
#+TBLFM: $3=round($2/2)::$4=round($2/5)

